# -*- ii: apisnoop; -*-
#+TITLE: Mock Ticket Template
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
** explore pods
  #+begin_src bash
    echo hello
kubectl get  pods
  #+end_src

  #+RESULTS:
  #+begin_example
  hello
  NAME                                   READY   STATUS                       RESTARTS   AGE
  apisnoop-auditlogger-fbf56b5ff-2mw4f   1/1     Running                      5          3h22m
  hasura-6c4f684498-pn67f                1/1     Running                      4          3h22m
  kubemacs-0                             1/1     Running                      0          3h32m
  master-0                               0/1     CreateContainerConfigError   0          3h32m
  pgadmin-fbb7659d7-ftwrh                1/1     Running                      0          3h23m
  postgres-58896767dc-48bnz              1/1     Running                      0          3h20m
  session-64f44b86cd-q4p2g               1/2     CreateContainerConfigError   0          3h32m
  webapp-858f4f9cf-97mhj                 1/1     Running                      0          3h22m
  #+end_example
** explore services
  #+begin_src shell
    kubectl get service
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME                   TYPE        CLUSTER-IP      EXTERNAL-IP   PORT(S)             AGE
  apisnoop-auditlogger   ClusterIP   10.96.96.96     <none>        9900/TCP            3h34m
  hasura                 ClusterIP   None            <none>        8080/TCP            3h34m
  kubemacs-tilt          ClusterIP   10.96.3.21      <none>        10350/TCP           3h43m
  master                 ClusterIP   10.96.164.70    <none>        4000/TCP            3h43m
  pgadmin                ClusterIP   10.96.223.84    <none>        80/TCP              3h34m
  postgres               ClusterIP   10.96.50.248    <none>        5432/TCP            3h32m
  session                ClusterIP   10.96.166.133   <none>        2200/TCP,4001/TCP   3h43m
  webapp                 ClusterIP   10.96.94.43     <none>        3000/TCP            3h33m
  #+end_example
** explore ingress
  #+begin_src shell
    kubectl get ingress
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME                    HOSTS                       ADDRESS        PORTS   AGE
  graphql-ingress         *                           10.96.123.28   80      3h35m
  hasura-ingress          hasura.127.0.0.1.xip.io     10.96.123.28   80      3h35m
  pgadmin-ingress         pgadmin.127.0.0.1.xip.io    10.96.123.28   80      3h35m
  tilt-ingress            tilt.127.0.0.1.xip.io       10.96.123.28   80      3h44m
  tmate-master-ingress    tmate.local.ii.nz           10.96.123.28   80      3h44m
  tmate-session-ingress   tmate-ws.local.ii.nz        10.96.123.28   80      3h44m
  webapp-ingress          apisnoop.127.0.0.1.xip.io   10.96.123.28   80      3h35m
  #+end_example
** deployments
  #+begin_src shell
    kubectl get deployment
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME                   READY   UP-TO-DATE   AVAILABLE   AGE
  apisnoop-auditlogger   1/1     1            1           3h35m
  hasura                 1/1     1            1           3h35m
  pgadmin                1/1     1            1           3h35m
  postgres               1/1     1            1           3h33m
  session                0/1     1            0           3h44m
  webapp                 1/1     1            1           3h34m
  #+end_example
** stateful sets  
#+begin_src shell
    kubectl get statefulset
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME       READY   AGE
  kubemacs   1/1     3h47m
  master     0/1     3h47m
  #+end_example
** tilt service info
   #+begin_src shell
     kubectl describe service/kubemacs-tilt
   #+end_src

   #+RESULTS:
   #+begin_example
   Name:              kubemacs-tilt
   Namespace:         kubemacs
   Labels:            <none>
   Annotations:       kubectl.kubernetes.io/last-applied-configuration:
                        {"apiVersion":"v1","kind":"Service","metadata":{"annotations":{},"name":"kubemacs-tilt","namespace":"kubemacs"},"spec":{"ports":[{"name":"...
   Selector:          app=kubemacs
   Type:              ClusterIP
   IP:                10.96.3.21
   Port:              10350  10350/TCP
   TargetPort:        10350/TCP
   Endpoints:         10.244.1.3:10350
   Session Affinity:  None
   Events:            <none>
   #+end_example
